JEB12345/dwm1000_dspic/dwm_spi.c
                // Need to actually fill out the packet
                to_lower_40bits(bcast_msg.tRR[0], global_tag_anchor_resp_rx_time);
                to_lower_40bits(bcast_msg.tSF,systimestamp + (convertmicrosectodevicetimeu(TAG_SEND_FINAL_DELAY_US)));
                
                dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);
                err = dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);
                dwt_settxantennadelay(global_tx_antenna_delay);
                tag_state = tag_stall;

            } else if(packet_type_byte == MSG_TYPE_ANC_FINAL){
                struct ieee154_final_msg* final_msg_ptr;
                final_msg_ptr = (struct ieee154_final_msg*) global_recv_pkt;
                int offset_idx = (final_msg_ptr->anchorID-1)*NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS;
                memcpy(&global_distances[offset_idx],final_msg_ptr->distanceHist,sizeof(fin_msg.distanceHist));
            }
        } else if (rxd->event == DWT_SIG_RX_TIMEOUT) {

        }

    } else if (DW1000_ROLE_TYPE == ANCHOR) {

        // The anchor should receive two packets: a POLL from a tag and
        // a FINAL from a tag.

        if (rxd->event == DWT_SIG_RX_OKAY) {
            struct ieee154_bcast_msg* msg_ptr;
            uint8_t packet_type_byte;
            uint64_t rxtimestamp;
            uint64_t systimestamp;
            uint8_t subseq_num;


            // Get the timestamp first
            uint8_t txTimeStamp[5] = {0, 0, 0, 0, 0};
            dwt_readrxtimestamp(txTimeStamp);
            rxtimestamp = (uint64_t) txTimeStamp[0] +
                        (((uint64_t) txTimeStamp[1]) << 8) +
                        (((uint64_t) txTimeStamp[2]) << 16) +
                        (((uint64_t) txTimeStamp[3]) << 24) +
                        (((uint64_t) txTimeStamp[4]) << 32);

            // tGet the packet
//            dwt_readrxdata(&packet_type_byte, 1, 15);
            dwt_readrxdata(global_recv_pkt, rxd->datalength, 0);
            msg_ptr = (struct ieee154_bcast_msg*) global_recv_pkt;
            packet_type_byte = global_recv_pkt[offsetof(struct ieee154_bcast_msg, messageType)];


            if (packet_type_byte == MSG_TYPE_TAG_POLL) {
                // Got POLL
                global_tRP = rxtimestamp;
//                global_tRP = dwt_readrxtimestamphi32();
                //memcpy(&global_tSP,&global_recv_pkt[offsetof(struct ieee154_bcast_msg, tSP)],sizeof(uint64_t));
                global_tSP = from_lower_40_bits(&global_recv_pkt[offsetof(struct ieee154_bcast_msg, tSP)]);

                // Send response
                dwt_forcetrxoff();
                
                // Set the packet length
                // FCS + SEQ + PANID:  5
                // ADDR:              16
                // PKT:                1
                // ANCHOR_ID:          1
                // CRC:                2
                // total              25
                uint16_t tx_frame_length = sizeof(msg); // Should be 25
                
                dwt_writetxfctrl(tx_frame_length, 0);
                
                dwt_setrxtimeout(0);
                
                uint8_t TimeStamp[5] = {0, 0, 0, 0, 0};
                dwt_readsystime(TimeStamp);
                systimestamp = (uint64_t) TimeStamp[0] +
                        (((uint64_t) TimeStamp[1]) << 8) +
                        (((uint64_t) TimeStamp[2]) << 16) +
                        (((uint64_t) TimeStamp[3]) << 24) +
                        (((uint64_t) TimeStamp[4]) << 32);

                // Calculate the delay
//                uint32_t dwt_time = dwt_readsystimestamphi32();
//                uint32_t delay_time = dwt_time + (convertmicrosectodevicetimeu32(ANC_RESP_DELAY)>>8);
                uint32_t delay_time = (uint32_t)((systimestamp)>>8) + (convertmicrosectodevicetimeu32(ANC_RESP_DELAY)>>8);
                delay_time &= 0xFFFFFFFE;
                dwt_setdelayedtrxtime(delay_time);
                global_tSR = systimestamp + (convertmicrosectodevicetimeu(ANC_RESP_DELAY));

                dwt_writetxdata(tx_frame_length, (uint8_t*) &msg, 0);

                err = dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);
                
                dwt_settxantennadelay(global_tx_antenna_delay);

                //Reset all the distance measurements
                memset(fin_msg.distanceHist, 0, sizeof(fin_msg.distanceHist));

                anchor_state = anchor_wait_final;
            } else if (packet_type_byte == MSG_TYPE_TAG_FINAL) {
                // Got FINAL

                // Read the whole packett
                dwt_readrxdata((uint8_t*)&bcast_msg, sizeof(bcast_msg), 0);

                global_tRF = rxtimestamp;
//                 global_tRF = dwt_readrxtimestamphi32();

                // ONLY WORKS IF VARIABLES ARE 64bits!!!
                // Correct TAG Times if rollover
                uint64_t tRR_tmp = from_lower_40_bits(bcast_msg.tRR[0]);
                uint64_t tSF_tmp = from_lower_40_bits(bcast_msg.tSF);
                if(global_tSP > tRR_tmp){
                    tRR_tmp += TWOPOWER40;
                    tSF_tmp += TWOPOWER40;
                }
                if(tRR_tmp > tSF_tmp){
                    tSF_tmp += TWOPOWER40;
                }
                to_lower_40bits(bcast_msg.tRR[0],tRR_tmp);
                to_lower_40bits(bcast_msg.tSF,tSF_tmp);
                
                // Correct ANCHOR times if rollover
                if(global_tRP > global_tSR){
                    global_tSR += TWOPOWER40;
                    global_tRF += TWOPOWER40;
                }
                if(global_tSR > global_tRF){
                    global_tRF += TWOPOWER40;
                }

                long double tRF = (long double)(((uint64_t)global_tRF));
                long double tSR = (long double)(((uint64_t)global_tSR));
                long double tRR = (long double)from_lower_40_bits(bcast_msg.tRR[0]);//((((uint64_t)bcast_msg.tRR_H)<<32)|(((uint64_t)bcast_msg.tRR_L)));//NCHOR_EUI-1];
                long double tSP = (long double)(((uint64_t)global_tSP));
                long double tSF = (long double)from_lower_40_bits(bcast_msg.tSF);
                long double tRP = (long double)(((uint64_t)global_tRP));

                if(tRF != 0.0 && tSR != 0.0 && tRR != 0.0 && tSP != 0.0 && tSF != 0.0 && tRP != 0.0){
                    
                    long double aot = (tRF-tRP)/(tSF-tSP);
                    long double tTOF = (tRF-tSR)-(tSF-tRR)*aot;
                    long double dist = (tTOF*DWT_TIME_UNITS)/2;

