JEB12345/dwm1000_dspic/dwm_spi.c
                    ////tTOF^2 + (-tRF + tSR - tRR + tSP)*tTOF + (tRR*tRF - tSP*tRF - tSR*tRR + tSP*tSR - (tSF-tRR)*(tSR-tRP)) = 0
//                    double a = 1.0;
//                    double b = -tRF + tSR - tRR + tSP;
//                    double c = tRR*tRF - tSP*tRF - tSR*tRR + tSP*tSR - (tSF-tRR)*(tSR-tRP);
//
//                    ////Perform quadratic equation
//                    double tTOF = (-b-sqrt(pow(b,2)-4*a*c))/(2*a);
//                    double dist = (tTOF * (double) DWT_TIME_UNITS) * 0.5;
                    dist *= SPEED_OF_LIGHT;
                    //double range_bias = 0.0;//dwt_getrangebias(global_chan, (float) dist, DWT_PRF_64M);
#ifndef DW_CAL_TRX_DELAY
                    dist += ANCHOR_CAL_LEN;
                    dist -= txDelayCal[ANCHOR_EUI*NUM_CHANNELS + 1];
#endif
                    #ifdef DW_DEBUG
                        printf("dist*100 = %d\r\n", (int)(dist*100));
                        //printf("range_bias*100 = %d\r\n", (int)(range_bias*100));
                    #endif
                    //dist -= dwt_getrangebias(2, (float) dist, DWT_PRF_64M);
                    fin_msg.distanceHist[global_subseq_num] = (float)dist;
                    dwm_status.distance = dist;
                }

                // Get ready to receive next POLL
                anchor_state = anchor_wait_receive;
                dwt_rxenable(0);
            }
        }
        else{
            dwt_rxenable(0);
        }
    }
}

void send_poll(){
    //Reset all the tRRs at the beginning of each poll event
	memset(bcast_msg.tRR, 0, sizeof(bcast_msg.tRR));//TODO: hacked
    //bcast_msg.tRR = 0;//_H = bcast_msg.tRR_L = 0;
    
	// Through tSP (tSF is field after) then +2 for FCS
    uint16_t tx_frame_length = sizeof(bcast_msg);
	memset(bcast_msg.destAddr, 0xFF, 2);

	bcast_msg.seqNum++;
//	bcast_msg.subSeqNum = global_subseq_num;

	// First byte identifies this as a POLL
	bcast_msg.messageType = MSG_TYPE_TAG_POLL;

	// Tell the DW1000 about the packet
	dwt_writetxfctrl(tx_frame_length, 0);

	// We'll get multiple responses, so let them all come in
	dwt_setrxtimeout(0);

	// Delay RX?
//	dwt_setrxaftertxdelay(1); // us
    
    uint8_t TimeStamp[5] = {0, 0, 0, 0, 0};
    dwt_readsystime(TimeStamp);
    uint64_t systimestamp = (uint64_t) TimeStamp[0] +
                (((uint64_t) TimeStamp[1]) << 8) +
                (((uint64_t) TimeStamp[2]) << 16) +
                (((uint64_t) TimeStamp[3]) << 24) +
                (((uint64_t) TimeStamp[4]) << 32);

//	uint32_t temp = dwt_readsystimestamphi32();
	//uint32_t delay_time = temp + GLOBAL_PKT_DELAY_UPPER32;
	//(APP_US_TO_DEVICETIMEU32(NODE_DELAY_US) & DELAY_MASK) >> 8
//	uint32_t delay_time = temp + ((convertmicrosectodevicetimeu32(TAG_SEND_POLL_DELAY_US)>>8));
    uint32_t delay_time = (uint32_t)((systimestamp)>>8) + ((convertmicrosectodevicetimeu32(TAG_SEND_POLL_DELAY_US)>>8));
	//uint32_t delay_time = dwt_readsystimestamphi32() + GLOBAL_PKT_DELAY_UPPER32;
	delay_time &= 0xFFFFFFFE; //Make sure last bit is zero
	dwt_setdelayedtrxtime(delay_time);
    uint64_t tSP_tmp = systimestamp + (convertmicrosectodevicetimeu(TAG_SEND_POLL_DELAY_US));
    to_lower_40bits(bcast_msg.tSP,tSP_tmp);
	
	// Write the data
	dwt_writetxdata(tx_frame_length, (uint8_t*) &bcast_msg, 0);

	// Start the transmission
	dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);

	// MP bug - TX antenna delay needs reprogramming as it is
	// not preserved
	dwt_settxantennadelay(TX_ANTENNA_DELAY);
}

void instance_process(){

#ifdef IS_TAG
    switch(tag_state){
        case tag_init:
            tag_state = tag_poll;
            break;

        case tag_poll:
            stall_count = 0;
            dwt_forcetrxoff();  // Force the tx or rx state off
            send_poll();
            tag_state = tag_wait_response;
            break;

        case tag_wait_response:
            wait_count++;
            if(wait_count > 200){
                tag_state = tag_poll;
                wait_count = 0;
            }
            break;

        case tag_final:
            wait_count = 0;
            break;

        case tag_stall:
            stall_count++;
            if(stall_count > 50){
                tag_state = tag_poll;
                stall_count = 0;
            }
            break;
    }
#endif
#ifdef IS_ANCHOR
    switch(anchor_state){
        case anchor_init:
            anchor_state = anchor_wait_receive;
            break;

        case anchor_wait_receive:
            // Waiting for poll message
            break;

        case anchor_wait_final:
            // Waiting for final message
            break;
    }
#endif
//    incr_subsequence_counter();
//    if(DW1000_ROLE_TYPE == TAG){
//        if(global_subseq_num < NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS){
//            //Make sure we're out of rx mode before attempting to transmit
//            dwt_forcetrxoff();
//
//            send_poll();
//        } else if(global_subseq_num == NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS){
//            dwt_rxenable(0);
//            dwt_setrxtimeout(0); // disable timeout
//        }
//    } else {
//        //If it's after the last ranging operation, queue outgoing range estimates
//        if(global_subseq_num == NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS){
//            //We're likely in RX mode, so we need to exit before transmission
//            dwt_forcetrxoff();
//
//            //Schedule this transmission for our scheduled time slot
//            uint32_t delay_time = dwt_readsystimestamphi32() + global_pkt_delay_upper32*(NUM_ANCHORS-ANCHOR_EUI+1)*2;
//            delay_time &= 0xFFFFFFFE;
//            dwt_setdelayedtrxtime(delay_time);
//            dwt_writetxfctrl(sizeof(fin_msg), 0);
//            dwt_writetxdata(sizeof(fin_msg), (uint8_t*) &fin_msg, 0);
//            dwt_starttx(DWT_START_TX_DELAYED);
//            dwt_settxantennadelay(global_tx_antenna_delay);
//            incr_subsequence_counter();
//        }
//    }
}

void incr_subsequence_counter(){
    global_subseq_num++;
    if(global_subseq_num > NUM_ANTENNAS*NUM_ANTENNAS*NUM_CHANNELS+1){
        global_subseq_num = 0;
    }
}

